Revit 2024 API
FamilyInstanceFilter.FamilySymbolId Property
 The family symbol id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId FamilySymbolId { get; }
Visual Basic
Public ReadOnly Property FamilySymbolId As ElementId
	Get
Visual C++
public:
property ElementId^ FamilySymbolId {
	ElementId^ get ();
}
See Also
FamilyInstanceFilter Class
Autodesk.Revit.DB Namespace